# Pandas Series

In [179]:
import pandas as pd
import numpy as np

In [180]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}
#we have 4 seperate python objects

In [181]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [182]:
pd.Series(data = my_data, index = labels)
# in pandas unlike numpy we can set our own labels
# now we can call our my_data items with the index (labels) i.e a,b,c

a    10
b    20
c    30
dtype: int64

In [183]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [184]:
pd.Series(arr) # numpy array will convert to a python list

0    10
1    20
2    30
dtype: int32

In [185]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [186]:
pd.Series(d) # in Dictionary, pandas will take the keys as an index

a    10
b    20
c    30
dtype: int64

In [187]:
# series can also hold any type of data: strings, integers, functions
# more flexibility in pandas as opposed to numpy

pd.Series(data = [sum, print , len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [188]:
ser1 = pd.Series([1,2,3,4], ['USA','Germany','USSR','Japan'])
ser1

# coutries are now acting as index

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [189]:
ser2 = pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [190]:
#since our index is now string(country names for ser 1 and ser 2) we will
# use string in the brackets as an idex to find a specific row, col, data etc.

In [191]:
ser1['USA']

1

In [192]:
ser3 = pd.Series(data = labels)
ser3

# now our index is an integer just like a numpy

0    a
1    b
2    c
dtype: object

In [193]:
ser3[0]

'a'

In [194]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [195]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [196]:
ser1 + ser2
# it will try to match the index and then add since we have italy and USSR in
# ser 2 and 1 , that means the index will not match and hene will not add
# and return nll for that index

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Pandas Data Frame

In [197]:
import numpy as np
import pandas as pd

In [198]:
from numpy.random import randn

In [199]:
np.random.seed(101)

In [200]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

# row index: abcde
#col index: wxyz
# W x y and z are all pandas series and they all share the same index i.e a-e

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [201]:

df['W'] # now we can see it is just like a series
# we can also confirm this by using type(df)

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [202]:
type(df['W'])

#type confirms that data frames are all in actual series which
# share the same index when in a dataframe

pandas.core.series.Series

In [203]:
df.W 

#just like SQL
# it will get the column directly, however not a recommended

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [204]:
# passing a list of columns

df[['W','Z']]

# NOW we will get a dataframe as a result
# so when we call for one column it's a series 
# when there are more than 1 it's a dataframe

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [205]:
type(df[['W','Z']]
)

pandas.core.frame.DataFrame

In [206]:
# creating a new column

df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [207]:
# removing a column

df.drop('new')
# we are geeting an error i.e new not found in axis
# to check that we can press shift tab by placing the cursone in brackets
#      df.drop('press shift tab')
# we will find that the default value is 0, that means default setting is row
# since there is no 'index' as 'new' in rows, we are getting an error, we only
# have a,b,c,d and e in index for rows,
# once we change the axis to 1, the python will look for new in index fro column
# and it will find the 'new' and will drop the whole column accordingly

KeyError: "['new'] not found in axis"

In [208]:

df.drop('new', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [209]:
# even after dropping the col 'new' we still see it when we call the df dataframe
# this means we have to tell pandas to effect the main dataframe as well
# to do this we will change the current default setting of 'inplace', that can
# be find by pressing sfift+tab in df.drop(press shift tab), to True
# this happens so that we don't lose our data easily

df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [210]:
df.drop('new', axis = 1, inplace = True)

# now we can see that the original df does no longer have 'new' column

In [211]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [212]:
# dropping rows
# we don't have to put axis = 0 since the default is set to 0
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [213]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [214]:
df.shape # five rows and five cols

(5, 4)

In [215]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

# Selecting Rows
# loc and i loc

In [216]:
# selecting rows has two methods

df.loc['A']
# once we get a row we can see that it's a series
# we can also conclude that not only all columns are series but also all the rows

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [217]:
# iloc allows us to locate the row using the POSITION OF THE INDEX
# INDEX for 3rd rows is "C", while th POSITION OF THE INDEX IS "2"
# iloc can use 2 to ge C, which will give the same results as df.loc['C']
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [218]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [219]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [220]:
# Subset of Rows and Columns
# We can located rows and cols Using comma notation just like comma in Numpy

df.loc['B','Y']

# value at row b col y

-0.8480769834036315

In [221]:
# gettin a subset of data

df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# Data Frame 2

In [222]:
df > 0

# we will ge boolean values based on the values within the data frame

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [223]:
bool_df = df > 0

In [224]:
df[bool_df]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [225]:
df['W'] > 0

# we get series back

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [226]:
# comparing it with results

df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [227]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [228]:

# get all the data/rows in data frame where column Z has values less than 0
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [229]:
result_df = df[df['W']>0]
result_df

# we have collected the dataframe where column W doesn't have a value greater than 0
# as a result the Row c is removed
#now we can use this dataframe (which no longer has row c) and further filter data
# for example geeting column x :- result_df['X']



# we can do the above steps into one go 
# see the codes below
# similalry we can get more than one column out of the filtered data

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [230]:
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [231]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [232]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [233]:
# all steps together in another example

boolser = df['W'] > 0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [234]:
# multiple conditions


df[(df['W']>0) and (df['Y'] > 1)]

# we will get an error by placing the and in between like in the query above

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [235]:
# the error occurs because pandas can only deal with one boolean value vs another
# boolean value and not one boolean series vs another boolean series
# the 'and' operattor doesn't work for this we need '&'


# df['W'] >0

# A     True
# B     True
# C    False
# D     True
# E     True
# Name: W, dtype: bool

# this example above is a series 



#use for multiple conditions
# to use 'or' we will use straight line
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [236]:
# Or condition

df[(df['W']>0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [237]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [238]:
# in order to chnage the index back to default i.e 0,1,2
# we will use reset_index()

df.reset_index()

# we will also need to add inplace = true to make this change on the original dataframe

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [239]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [240]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [241]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [242]:
# if we have a column that we want to make as index we will
# use the function .set_index()

In [243]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [244]:
df2 = pd.DataFrame(
    
    
                  [('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                   
                   
                  index=['falcon', 'parrot', 'lion', 'monkey'],
                   
                   
                  columns=('class', 'max_speed'))

In [245]:
df2

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

# df2.reset_index()
#When we reset the index, the old index is added as a column, and a new sequential index is used:

In [246]:
#We can use the drop parameter to avoid the old index being added as a column:

df2.reset_index(drop=True)

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN

In [247]:

#You can also use reset_index with MultiIndex.


index = pd.MultiIndex.from_tuples([('bird', 'falcon'),
                                   ('bird', 'parrot'),
                                   ('mammal', 'lion'),
                                   ('mammal', 'monkey')],
                                  names=['class', 'name'])

columns = pd.MultiIndex.from_tuples([('speed', 'max'),
                                     ('species', 'type')])
df3 = pd.DataFrame([(389.0, 'fly'),
                   ( 24.0, 'fly'),
                   ( 80.5, 'run'),
                   (np.nan, 'jump')],
                  index=index,
                  columns=columns)

In [248]:
df3

               speed species
                 max    type
class  name
bird   falcon  389.0     fly
       parrot   24.0     fly
mammal lion     80.5     run
       monkey    NaN    jump

# Multi Index and Index Heirarchy

In [249]:
import numpy as np
import pandas as pd

In [250]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [251]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [252]:
inside

[1, 2, 3, 1, 2, 3]

In [253]:
x = zip(outside,inside)
tuple(x)

(('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3))

In [254]:
 list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [255]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [256]:
df = pd.DataFrame(randn(6,2),hier_index, ['A','B'])
df

# we will have random numbers
# 6rows and two cols
# the third parameter of DataFrame is always cols
# we could have alsow written as cols = ['A','B']
#we will get multilevel dataframe since we hace one tuple containing two elements
# G1 with 1, G1 with 2 and G1 with 3, similarly we have the same for G2
# The tuple splits like a groupby from SQL
# FOR Example : g AND THEN 1, G AND THEN 2 ...... SO ON
        # G1 ----> 1
        #    ----> 2
        #    ----> 3

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [257]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [258]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [259]:
df
# we can see that none of our index have any names,
# we can confirm this via command df.index.names

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [260]:
df.index.names
# no names given to our index

FrozenList([None, None])

In [261]:
#naming index
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [262]:
df.loc['G2'].loc[2]

A    0.807706
B    0.072960
Name: 2, dtype: float64

In [263]:
df.loc['G2'].loc[2]['B']

# we can't do ['B'][2]

0.07295967531703869

In [264]:
#cross-section of rows and column
# for multi level index


df.loc['G1']

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [265]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [266]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [267]:
# getting all the values in the data with Num =1, this would mean
# we need Num =1 from both G1 and G2

df.xs(1, level = 'Num')
# the code will give us cross-section of the data with Num as value 1 for index

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data
# Pandas automatically assign NA to the missing values

In [268]:
d = {'A':[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [269]:
df.dropna() # pandas will drop any row with 1 or more null values
            # pandas by default will  remove rows with Na due to 
            # axis which is set to 0
            # to drop a column we can change the axis = 1

     A    B  C
0  1.0  5.0  1

In [270]:
# dropping columns instead of rows

df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [271]:
df.dropna(#press tab to see threshold")

SyntaxError: unexpected EOF while parsing (<ipython-input-271-19e02f3b2534>, line 1)

In [272]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [273]:
df.dropna(thresh = 2) # thresh two will keep all the rows with atleas 2 
                    # non-null values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [274]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [275]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [276]:
df['A'].fillna(value = df['A'].mean())
# filling values with mean of column a

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Group BY

# GROUP VALUES AND PERFORM AGG ON VALUES

In [277]:
import pandas as pd
import numpy as np

In [278]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT','MSFT', 'FB','FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'], 
        'Sales':[200, 120, 340, 124, 243, 350]}

data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [279]:
df= pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [280]:
df.groupby('Company')

In [281]:
byComp = df.groupby('Company')

In [282]:
#pandas automatically recognizen non-nimeric column and skipped it
# during the group by, in this case (Person Column)
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [283]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [284]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [285]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [286]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [287]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [288]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [289]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [290]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [291]:
df.groupby('Company').describe().loc['FB'].transpose()

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# Merging Joining and Concatenating

In [292]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [293]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [294]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [295]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [296]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [297]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [298]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [299]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [300]:
# key column is the same as

In [301]:
pd.merge(left,right, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [302]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [303]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [304]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [305]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [306]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [307]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [308]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

# Joining 
# In joining the join is done via indexing unlike merge, where join is done on columns

In [309]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [310]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [311]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [312]:
left.join(right) # inner join

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [313]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

In [314]:
import pandas as pd 
import numpy as np

In [315]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [316]:
#finding unique methods
# methods
#unique

In [317]:
df['col2'].unique()
# checking unique values in col2

array([444, 555, 666], dtype=int64)

In [318]:
#finding num of unique values itself
# 2 methods
# len
#nunique
len(df['col2'].unique())

3

In [319]:
df['col2'].nunique()

3

In [320]:
#3rd method

df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [321]:
df[df['col1']>2]
# return dataframe where col1 has value greater than 2

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [322]:
df[ (df['col1']>2)  & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [323]:
# apply method

def times2(x):
    return x * 2

In [324]:
df['col1'].sum()

10

In [325]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [326]:
# what if we want to apply a function on a value
# we can use apply function for that

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [327]:
df['col3'].apply(len) # length function applied

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [328]:
# instead of creating a function 
# we can use lambda function to do the job for us
# this way we can save time

df['col2'].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [329]:
#removign columns


df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [330]:
df.drop('col1', axis = 1)

# put inplace = true to affect the main dataframe as well

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [331]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [332]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [333]:
#sorting
# of data by columns
# press shift tabl inside brackets to see more options
# we can either type the column name or add the name of the list and then it will
# sort according to the items in the list

df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [334]:
df.sort_values(by = 'col1')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [335]:
df.sort_values(by = 'col2', axis = 0)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [336]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [337]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [339]:
df.sort_values(by = 'col3' , axis = 0)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [340]:
df.sort_values(by = 'col1' , axis = 0)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [341]:
df.sort_values(by = 'col1' , axis = 1)

KeyError: 'col1'

In [344]:
df.sort_values(by = 'col1' , axis = 1)

KeyError: 'col1'

In [172]:
df.sort_values(by = 'col1' , axis = 1)

KeyError: 'col1'

In [171]:
df.sort_values(by=df.columns[0])

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [161]:
# null values

df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [162]:
# PIVOT TABLE

In [163]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [164]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = ['C'])


# values is the main parameter, it contains the values that we want
# in the example below we want values/data points from d column i.e why its param 
# is 1 i.e valuesd

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [165]:
#location of pandas
import pandas as pd

#press shift enter

In [166]:
pwd

'C:\\Users\\hamza\\Python Pandas\\Python for Data Science and Machine Learning\\Pandas Practice'

In [167]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [168]:
# to read any file just use pd.read
#to check al the type of files that panda can read press tab

pd.read_

AttributeError: module 'pandas' has no attribute 'read_'

In [169]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [170]:
df.to_csv('My_output', index = False)
#saving a csv file withou the inds